{
    "version": "https://jsonfeed.org/version/1",
    "title": "Thoughtgeek",
    "home_page_url": "thoughtgeek.com/",
    "feed_url": "thoughtgeek.com/feed.json",
    "description": "another human trying to tame machines",
    "icon": "thoughtgeek.com/apple-touch-icon.png",
    "favicon": "thoughtgeek.com/favicon.ico",
    "expired": false,
    
    "author": "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>"contact@thoughtgeek.com", "url"=>nil}",
    
"items": [
    
        {
            "id": "thoughtgeek.com/2020/07/16/powerful-python-features",
            "title": "Some powerful features of Python",
            "summary": "Important python features",
            "content_text": "Coding in Python for a year now has been quite a pleasurable experience and frankly I would trade it for no other language given that the simplicity of Python provides a much more friendly learning curve than anything else out there. For example, in Python, nothing obliges you to write classes and instantiate objects from them. If you don’t need complex structures in your project, you can just write functions. Even better, you can write a flat script for executing some simple and quick task without structuring the code at all.Python’s philosophy is built on top of the idea of well thought out best practices. Python is a dynamic language and as such, already implements, or makes it easy to implement, a number of popular design patterns with a few lines of code. However, Python programs are easily scalable and the language is versatile enough to provide various degrees of control which as and when needed can be used to solve problems in a much efficient way. This article will talk about a few of those features which I personally find distinctive of the Python language.Understanding the double-underscore( __ ) of PythonMethods that begin and end with a double underscore are called dunder (a contraction of “double underscore”) or magic methods.What’s the magic? Well, they are never called directly–instead, they are called via a mapping from a built-in function or operator, or, in the case of __init__, it is called automagically when an object is created.Let’s start with __init__, since it’s the first one people typically learn:class Thing:    def __init__(self):        print('In __init__!')    &gt;&gt;&gt; t = Thing()In __init__!So you see that __init__ an initializer method is called when I created a new Thing object.Suppose I want to add two Thing objects together–it doesn’t work, because my Thing type has not defined what it means to add two Things:&gt;&gt;&gt; t1 = Thing()In __init__!&gt;&gt;&gt; t2 = Thing()In __init__!&gt;&gt;&gt; t1 + t2Traceback (most recent call last):File \"&lt;stdin&gt;\", line 1, in &lt;module&gt;TypeError: unsupported operand type(s) for +: 'Thing' and 'Thing'Let’s fix that:&gt;&gt;&gt; class Thing:...\tdef __init__(self, moniker):... \t\tself.moniker = moniker...... def __add__(self, other):... \tprint('In __add__!')... \treturn Thing(self.moniker + ' ' + other.moniker)...&gt;&gt;&gt; t1 = Thing('one')&gt;&gt;&gt; t2 = Thing('two')&gt;&gt;&gt; t3 = t1 + t2In __add__!&gt;&gt;&gt; t3.moniker'one two'So now we see that we can use the good old plus sign for addition, and when we do that, Python invokes the add method for Thing objects.We could invoke add directly, even for integers, if we wanted:&gt;&gt;&gt; int.__add__(2, 2)4We could say that operators such as + invoke dunder methods under the hood.But sometimes Python’s built-in functions invoke dunder methods. len() is a good example:&gt;&gt;&gt;len('Python')6&gt;&gt;&gt;'Python'.__len__()6So when we call len() on an object, Python invokes len() for that object. Let’s try it on an int:&gt;&gt;&gt; x = 4&gt;&gt;&gt; len(x)Traceback (most recent call last):File \"&lt;stdin&gt;\", line 1, in &lt;module&gt;TypeError: object of type 'int' has no len()The only reason it doesn’t work is because the int object has no len() method, not because integers are not iterable. Let’s create an int type which has a len() method:&gt;&gt;&gt; class autolen(int):... def __len__(self):... return len(str(self))The autolen object inherits from int and adds a len() method which returns the number of digits in the autolen:&gt;&gt;&gt; x = autolen(12345678)&gt;&gt;&gt; x ** 2152415765279684&gt;&gt;&gt; len(x)8So we can do int-y stuff with our autolen objects (since it inherits from int) and we can also call len() on them.There is an exhaustive list of all such special functions, go check them out: https://docs.python.org/3/reference/datamodel.html#special-method-namesWhat is meta of classes?A metaclass is the class of a class. A class defines how an instance of the class (i.e. an object) behaves while a metaclass defines how a class behaves. A class is an instance of a metaclass.While in Python you can use arbitrary callables for metaclasses, the better approach is to make it an actual class itself. type is the usual metaclass in Python. type is itself a class, and it is its own type. You won’t be able to recreate something like type purely in Python, but Python cheats a little. To create your own metaclass in Python you really just want to subclass type.A metaclass is most commonly used as a class-factory. When you create an object by calling the class, Python creates a new class (when it executes the ‘class’ statement) by calling the metaclass. Combined with the normal __init__ and __new__ methods, metaclasses therefore allow you to do ‘extra things’ when creating a class, like registering the new class with some registry or replace the class with something else entirely.When the class statement is executed, Python first executes the body of the class statement as a normal block of code. The resulting namespace (a dict) holds the attributes of the class-to-be. The metaclass is determined by looking at the baseclasses of the class-to-be (metaclasses are inherited), at the __metaclass__ attribute of the class-to-be (if any) or the __metaclass__ global variable. The metaclass is then called with the name, bases and attributes of the class to instantiate it.However, metaclasses actually define the type of a class, not just a factory for it, so you can do much more with them. You can, for instance, define normal methods on the metaclass. These metaclass-methods are like classmethods in that they can be called on the class without an instance, but they are also not like classmethods in that they cannot be called on an instance of the class. type.__subclasses__() is an example of a method on the type metaclass. You can also define the normal ‘magic’ methods, like __add__, __iter__ and __getattr__, to implement or change how the class behaves.Now let’s simplify what all that jargon means. Let’s consider a situation where a company has 2 teams, one for writing the library for the system while the other team is responsible for more of the application/business logic. The application developers thus use the libraries created for them by the library team. Now, say the application developer wants to be sure that there is a particular method defined in a class from the library from which a derived class is created in the application code. The easiest way to check it would be something like this.assert hasassert (BaseClass, MethodToCheck), “Its not there”  So this is an example of a derived class enforcing some constraints on the base class. How about when the library developers want the base class to enforce some constraints on the derived class? Perfect excuse to use metaclasses!class BaseMeta(type):    def __new__(cls, name, bases, body):    if not 'bar' in body:\t    raise TypeError('Derived class does not have bar defined')    return super().__new__(cls, name, bases, body)class Base(metaclass=BaseMeta):    def foo(self):\treturn self.bar()  Here we define the metaclass deriving from the class ‘type’ which checks for the bar method in the derived class and returns an error when it is unable to find it defined. This is the perfect example of one of the key use cases of metaclasses.A pinch of syntactic sugar called decoratorsLet’s start with the basics: Everything in Python is an object. So functions are objects too. Now that means we could have functions as arguments passed on to another function. These functions are called higher-order functions. Thus, a higher-order function is a function that takes one or more functions as inputs and returns a function. I.e.h(x) = f(g(x))  where here f() is a higher-order function that takes a function of a single argument, g(x), and returns a function of a single argument, h(x). You can think of f() as modifying the behaviour of g().Decorators are syntactic sugar for applying in Python. They make an ugly statement look pretty, that’s it.Here is the decorator syntax,@helloGalaxy@helloSolarSystemdef hello(targetName=None):is equivalent to,hello = helloGalaxy(helloSolarSystem(hello))So, this is a illustrative description of a decorator. Read through the comments.# A decorator is a function that expects ANOTHER function as parameterdef my_shiny_new_decorator(a_function_to_decorate):    def the_wrapper_around_the_original_function():\t    print 'Before the function runs'        a_function_to_decorate()        print 'After the function runs'        return the_wrapper_around_the_original_functionNow imagine you create a function you don’t want to ever touch again.def a_stand_alone_function():\t    print 'I am a stand alone function, don’t you dare modify me'        a_stand_alone_function()Output: I am a stand alone function, don't you dare modify meWell, you can decorate it to extend its behavior. Just pass it to the decorator, it will wrap it dynamically in any code you want and return you a new function ready to be used:a_stand_alone_function_decorated = my_shiny_new_decorator(a_stand_alone_function)a_stand_alone_function_decorated()And this is exactly equal to -@my_shiny_new_decorator  a_stand _alone_function  Output:Before the function runsI am a stand alone function, don't you dare modify meAfter the function runsIterators and Generators, what are they?In Python, an iterator is an object which implements the iterator protocol. The iterator protocol consists of two methods. The __iter__() method, which must return the iterator object, and the next() method, which returns the next element from a sequence.Iterators have several advantages:      Cleaner code        Iterators can work with infinite sequences        Iterators save resources  Python has several built-in objects, which implement the iterator protocol. For example lists, tuples, strings, dictionaries or files.# iterator.pystr = \"formidable\"for e in str:    print(e, end=\" \")print()it = iter(str)print(it.next())print(it.next())print(it.next())print(list(it))In the code example, we show a built-in iterator on a string. In Python a string is an immutable sequence of characters. The iter() function returns an iterator on object. We can also use the list() or tuple() functions on iterators.To understand this better, let’s pretend that we want to create an object that would let us iterate over a linear sequence of numbers(incremented by 1).class Linear_sequence:    def init(self):            self.initial = 0            self.max = 20def __iter__(self):        # Return the iterable object (self)        return selfdef next(self):        # When we need to stop the iteration we just need to raise        # a StopIteration exception        if self.initial &gt; self.max:                raise StopIteration        # save the value that has to be returned        value_to_be_returned = self.initial + 1        # calculate the next values of the sequence        self.initial += 1        return value_to_be_returneddef __next__(self):        # For compatibility with Python3        return self.next()if name == ‘main’:    seq = Linear_sequence()    for number in seq:            print(number)As you can see, all we’ve done is creating a class that implements the iteration protocol. This protocol is contained in two methods: the “iter” method that returns the object we would iterate over and the “next” method that is called automatically on each iteration and that returns the value for the current iteration.Please note that the protocol in Python 3 is a little different and the “next()” method is called “__next__()”Now, lets move on to Generators.Generators in Python are just another way of creating iterable objects and are usually used when you need to create iterable object quickly, without the need of creating a class and adopting the iteration protocol. To create a generator you just need to define a function and then use the yield keyword instead of return.So, the Linear sequence in a generator could be something like this:def linear_sequence(max):a = 0while a &lt; max:    a += 1    yield aYes, so simple! Now, if you want to test it just use your new linear sequence generator function:if __name__ == '__main__':linear_generator = linear_sequence(20)# print out all the sequence        for number in linear_generator:    print(number)Every generator is an iterator, but not vice versa. A generator is built by calling a function that has one or more yield expressions (yield statements, in Python 2.5 and earlier), and is an object that meets the previous paragraph’s definition of an iterator.You may want to use a custom iterator, rather than a generator, when you need a class with somewhat complex state-maintaining behavior, or want to expose other methods besides next (and __iter__ and __init__). Most often, a generator (sometimes, for sufficiently simple needs, a generator expression) is sufficient, and it’s simpler to code because state maintenance (within reasonable limits) is basically “done for you” by the frame getting suspended and resumed.So the topics covered show a small glimpse of what power the Python programming language gives us, hence someone can start learning the basics and the rest is taken care of by Python. However, once someone gets better at it, they have more control and ability to take over much of the action that happens under the hood and build out to their desired results.",
            "content_html": "<p>Coding in Python for a year now has been quite a pleasurable experience and frankly I would trade it for no other language given that the simplicity of Python provides a much more friendly learning curve than anything else out there. For example, in Python, nothing obliges you to write classes and instantiate objects from them. If you don’t need complex structures in your project, you can just write functions. Even better, you can write a flat script for executing some simple and quick task without structuring the code at all.</p><p>Python’s philosophy is built on top of the idea of well thought out best practices. Python is a dynamic language and as such, already implements, or makes it easy to implement, a number of popular design patterns with a few lines of code. However, Python programs are easily scalable and the language is versatile enough to provide various degrees of control which as and when needed can be used to solve problems in a much efficient way. This article will talk about a few of those features which I personally find distinctive of the Python language.</p><h2 id=\"understanding-the-double-underscore-__--of-python\">Understanding the double-underscore( __ ) of Python</h2><p>Methods that begin and end with a double underscore are called dunder (a contraction of “double underscore”) or magic methods.</p><p>What’s the magic? Well, they are never called directly–instead, they are called via a mapping from a built-in function or operator, or, in the case of __init__, it is called automagically when an object is created.</p><p>Let’s start with __init__, since it’s the first one people typically learn:</p><pre><code>class Thing:    def __init__(self):        print('In __init__!')    &gt;&gt;&gt; t = Thing()In __init__!</code></pre><p>So you see that __init__ an initializer method is called when I created a new Thing object.</p><p>Suppose I want to add two Thing objects together–it doesn’t work, because my Thing type has not defined what it means to add two Things:</p><pre><code>&gt;&gt;&gt; t1 = Thing()In __init__!&gt;&gt;&gt; t2 = Thing()In __init__!&gt;&gt;&gt; t1 + t2Traceback (most recent call last):File \"&lt;stdin&gt;\", line 1, in &lt;module&gt;TypeError: unsupported operand type(s) for +: 'Thing' and 'Thing'</code></pre><p>Let’s fix that:</p><pre><code>&gt;&gt;&gt; class Thing:...\tdef __init__(self, moniker):... \t\tself.moniker = moniker...... def __add__(self, other):... \tprint('In __add__!')... \treturn Thing(self.moniker + ' ' + other.moniker)...&gt;&gt;&gt; t1 = Thing('one')&gt;&gt;&gt; t2 = Thing('two')&gt;&gt;&gt; t3 = t1 + t2In __add__!&gt;&gt;&gt; t3.moniker'one two'</code></pre><p>So now we see that we can use the good old plus sign for addition, and when we do that, Python invokes the <strong>add</strong> method for Thing objects.</p><p>We could invoke <strong>add</strong> directly, even for integers, if we wanted:</p><pre><code>&gt;&gt;&gt; int.__add__(2, 2)4</code></pre><p>We could say that operators such as + invoke dunder methods under the hood.</p><p>But sometimes Python’s built-in functions invoke dunder methods. len() is a good example:</p><pre><code>&gt;&gt;&gt;len('Python')6&gt;&gt;&gt;'Python'.__len__()6</code></pre><p>So when we call len() on an object, Python invokes <strong>len</strong>() for that object. Let’s try it on an int:</p><pre><code>&gt;&gt;&gt; x = 4&gt;&gt;&gt; len(x)Traceback (most recent call last):File \"&lt;stdin&gt;\", line 1, in &lt;module&gt;TypeError: object of type 'int' has no len()</code></pre><p>The only reason it doesn’t work is because the int object has no <strong>len</strong>() method, not because integers are not iterable. Let’s create an int type which has a <strong>len</strong>() method:</p><pre><code>&gt;&gt;&gt; class autolen(int):... def __len__(self):... return len(str(self))</code></pre><p>The autolen object inherits from int and adds a <strong>len</strong>() method which returns the number of digits in the autolen:</p><pre><code>&gt;&gt;&gt; x = autolen(12345678)&gt;&gt;&gt; x ** 2152415765279684&gt;&gt;&gt; len(x)8</code></pre><p>So we can do int-y stuff with our autolen objects (since it inherits from int) and we can also call len() on them.</p><p>There is an exhaustive list of all such special functions, go check them out: https://docs.python.org/3/reference/datamodel.html#special-method-names</p><h2 id=\"what-is-meta-of-classes\">What is meta of classes?</h2><p>A metaclass is the class of a class. A class defines how an instance of the class (i.e. an object) behaves while a metaclass defines how a class behaves. A class is an instance of a metaclass.</p><p>While in Python you can use arbitrary callables for metaclasses, the better approach is to make it an actual class itself. type is the usual metaclass in Python. type is itself a class, and it is its own type. You won’t be able to recreate something like type purely in Python, but Python cheats a little. To create your own metaclass in Python you really just want to subclass type.</p><p>A metaclass is most commonly used as a class-factory. When you create an object by calling the class, Python creates a new class (when it executes the ‘class’ statement) by calling the metaclass. Combined with the normal __init__ and __new__ methods, metaclasses therefore allow you to do ‘extra things’ when creating a class, like registering the new class with some registry or replace the class with something else entirely.</p><p>When the class statement is executed, Python first executes the body of the class statement as a normal block of code. The resulting namespace (a dict) holds the attributes of the class-to-be. The metaclass is determined by looking at the baseclasses of the class-to-be (metaclasses are inherited), at the __metaclass__ attribute of the class-to-be (if any) or the __metaclass__ global variable. The metaclass is then called with the name, bases and attributes of the class to instantiate it.</p><p>However, metaclasses actually define the type of a class, not just a factory for it, so you can do much more with them. You can, for instance, define normal methods on the metaclass. These metaclass-methods are like classmethods in that they can be called on the class without an instance, but they are also not like classmethods in that they cannot be called on an instance of the class. type.__subclasses__() is an example of a method on the type metaclass. You can also define the normal ‘magic’ methods, like __add__, __iter__ and __getattr__, to implement or change how the class behaves.</p><p>Now let’s simplify what all that jargon means. Let’s consider a situation where a company has 2 teams, one for writing the library for the system while the other team is responsible for more of the application/business logic. The application developers thus use the libraries created for them by the library team. Now, say the application developer wants to be sure that there is a particular method defined in a class from the library from which a derived class is created in the application code. The easiest way to check it would be something like this.</p><pre><code>assert hasassert (BaseClass, MethodToCheck), “Its not there”  </code></pre><p>So this is an example of a derived class enforcing some constraints on the base class. How about when the library developers want the base class to enforce some constraints on the derived class? Perfect excuse to use metaclasses!</p><pre><code>class BaseMeta(type):    def __new__(cls, name, bases, body):    if not 'bar' in body:\t    raise TypeError('Derived class does not have bar defined')    return super().__new__(cls, name, bases, body)class Base(metaclass=BaseMeta):    def foo(self):\treturn self.bar()  </code></pre><p>Here we define the metaclass deriving from the class ‘type’ which checks for the bar method in the derived class and returns an error when it is unable to find it defined. This is the perfect example of one of the key use cases of metaclasses.</p><h2 id=\"a-pinch-of-syntactic-sugar-called-decorators\">A pinch of syntactic sugar called decorators</h2><p>Let’s start with the basics: Everything in Python is an object. So functions are objects too. Now that means we could have functions as arguments passed on to another function. These functions are called higher-order functions. Thus, a higher-order function is a function that takes one or more functions as inputs and returns a function. I.e.</p><pre><code>h(x) = f(g(x))  </code></pre><p>where here f() is a higher-order function that takes a function of a single argument, g(x), and returns a function of a single argument, h(x). You can think of f() as modifying the behaviour of g().</p><p>Decorators are syntactic sugar for applying in Python. They make an ugly statement look pretty, that’s it.</p><p>Here is the decorator syntax,</p><pre><code>@helloGalaxy@helloSolarSystemdef hello(targetName=None):</code></pre><p>is equivalent to,</p><pre><code>hello = helloGalaxy(helloSolarSystem(hello))</code></pre><p>So, this is a illustrative description of a decorator. Read through the comments.</p><pre><code># A decorator is a function that expects ANOTHER function as parameterdef my_shiny_new_decorator(a_function_to_decorate):    def the_wrapper_around_the_original_function():\t    print 'Before the function runs'        a_function_to_decorate()        print 'After the function runs'        return the_wrapper_around_the_original_function</code></pre><p>Now imagine you create a function you don’t want to ever touch again.</p><pre><code>def a_stand_alone_function():\t    print 'I am a stand alone function, don’t you dare modify me'        a_stand_alone_function()</code></pre><p><strong>Output:</strong> <code>I am a stand alone function, don't you dare modify me</code></p><p>Well, you can decorate it to extend its behavior. Just pass it to the decorator, it will wrap it dynamically in any code you want and return you a new function ready to be used:</p><pre><code>a_stand_alone_function_decorated = my_shiny_new_decorator(a_stand_alone_function)a_stand_alone_function_decorated()</code></pre><p>And this is exactly equal to -</p><pre><code>@my_shiny_new_decorator  a_stand _alone_function  </code></pre><p><strong>Output:</strong></p><pre><code>Before the function runsI am a stand alone function, don't you dare modify meAfter the function runs</code></pre><h1 id=\"iterators-and-generators-what-are-they\">Iterators and Generators, what are they?</h1><p>In Python, an iterator is an object which implements the iterator protocol. The iterator protocol consists of two methods. The __iter__() method, which must return the iterator object, and the next() method, which returns the next element from a sequence.</p><p>Iterators have several advantages:</p><ul>  <li>    <p>Cleaner code</p>  </li>  <li>    <p>Iterators can work with infinite sequences</p>  </li>  <li>    <p>Iterators save resources</p>  </li></ul><p>Python has several built-in objects, which implement the iterator protocol. For example lists, tuples, strings, dictionaries or files.</p><pre><code># iterator.pystr = \"formidable\"for e in str:    print(e, end=\" \")print()it = iter(str)print(it.next())print(it.next())print(it.next())print(list(it))</code></pre><p>In the code example, we show a built-in iterator on a string. In Python a string is an immutable sequence of characters. The iter() function returns an iterator on object. We can also use the list() or tuple() functions on iterators.</p><p>To understand this better, let’s pretend that we want to create an object that would let us iterate over a linear sequence of numbers(incremented by 1).</p><p>class Linear_sequence:    def <strong>init</strong>(self):            self.initial = 0            self.max = 20</p><pre><code>def __iter__(self):        # Return the iterable object (self)        return selfdef next(self):        # When we need to stop the iteration we just need to raise        # a StopIteration exception        if self.initial &gt; self.max:                raise StopIteration        # save the value that has to be returned        value_to_be_returned = self.initial + 1        # calculate the next values of the sequence        self.initial += 1        return value_to_be_returneddef __next__(self):        # For compatibility with Python3        return self.next()</code></pre><p>if <strong>name</strong> == ‘<strong>main</strong>’:    seq = Linear_sequence()    for number in seq:            print(number)</p><p>As you can see, all we’ve done is creating a class that implements the iteration protocol. This protocol is contained in two methods: the “iter” method that returns the object we would iterate over and the “next” method that is called automatically on each iteration and that returns the value for the current iteration.</p><p>Please note that the protocol in Python 3 is a little different and the “next()” method is called “__next__()”</p><p><strong>Now, lets move on to Generators.</strong></p><p>Generators in Python are just another way of creating iterable objects and are usually used when you need to create iterable object quickly, without the need of creating a class and adopting the iteration protocol. To create a generator you just need to define a function and then use the yield keyword instead of return.</p><p>So, the Linear sequence in a generator could be something like this:</p><pre><code>def linear_sequence(max):a = 0while a &lt; max:    a += 1    yield a</code></pre><p>Yes, so simple! Now, if you want to test it just use your new linear sequence generator function:</p><pre><code>if __name__ == '__main__':linear_generator = linear_sequence(20)# print out all the sequence        for number in linear_generator:    print(number)</code></pre><p>Every generator is an iterator, but not vice versa. A generator is built by calling a function that has one or more yield expressions (yield statements, in Python 2.5 and earlier), and is an object that meets the previous paragraph’s definition of an iterator.</p><p>You may want to use a custom iterator, rather than a generator, when you need a class with somewhat complex state-maintaining behavior, or want to expose other methods besides next (and __iter__ and __init__). Most often, a generator (sometimes, for sufficiently simple needs, a generator expression) is sufficient, and it’s simpler to code because state maintenance (within reasonable limits) is basically “done for you” by the frame getting suspended and resumed.</p><p>So the topics covered show a small glimpse of what power the Python programming language gives us, hence someone can start learning the basics and the rest is taken care of by Python. However, once someone gets better at it, they have more control and ability to take over much of the action that happens under the hood and build out to their desired results.</p>",
            "url": "thoughtgeek.com/2020/07/16/powerful-python-features",
            
            
            
            
            
            "date_published": "2020-07-16T00:00:00+05:30",
            "date_modified": "2020-07-16T00:00:00+05:30",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>"contact@thoughtgeek.com", "url"=>nil}"
                
            
        },
    
        {
            "id": "thoughtgeek.com/2020/02/20/clean-code",
            "title": "How to write clean code",
            "summary": "Clean code",
            "content_text": "Book summary seriesA Handbook of Agile Software Craftsmanship by Robert C. MartinClean code is an awesome book written by Uncle Bob and he absolutely nails it when he talks about the basic principles of writing well thought out human readable code. I thought I would make a small collection of takeaways from great books and I decided to start with this classic more like a reference for myself, but would be great to know if it helped someone else on thier journey.Chapter 1: Clean codeThe first chapter was mostly a dialogue between the author and the reader. He(the author henceforth) broadly talks about these points.      There will be code   He argues that code is always going to exist. No matter whatever fancy future code churning AI comes out, we will always need code as means to fine tune software to the ultimate precision and objectivity to fulfill rules written by humans in our own language.        Bad Code  Here he emphasizes on the LeBlanc’s law: Later equals never. He talks about how we end up writing bad code or code that is difficult to read and comprehend quickly due to various practical constraints of working at a technology company and even cited a killer app in 80s that went down because of their messy code.        Total cost of owning a mess  He talks how code keeps getting tangled with time and addition of new members working with the code and experienced members leaving the organisation. This ultimately leads to the next point.        The Grand Redesign in the Sky  Too many problems, lets start redesigning our systems. However when the redesign happens, it has to keep pace with the existing legacy system. This can take a while to complete and by the time, half of the original people starting the redesign have left the firm.        Attitude  We should own up to the fact that we are the ones who keep writing messy code for whatever reason and that should change.        The art of clean code  Clean code is more like an acquired taste over time of defining what is ‘clean’ and what is not. Everyone might not be easily able to write clean code but should have the eye to spot clean and unclean code.  What is Clean code?Clean code has been defined in many ways. There are some mentions of what clean code means to some of the brightest minds of the tech industry.      Bjarne Stroustrup, inventor of C++:I like my code to be elegant and efficient. The logic should be straightforward and make it hard for bugs to hide, the dependencies minimal to ease maintenance, error handling complete according to an articulated strategy, and performance close to optimal so as not to tempt people to make the code messy with unprincipled optimizations. Clean code does one thing well.        Grady Booch, author of Object-Oriented Analysis and Design with Applications:Clean code is simple and direct. Clean code reads like well-written prose. Clean code never obscures the designers’ intent but rather is full of crisp abstractions and straightforward lines of control.        “Big” Dave Thomas, founder of OTI and godfather of the Eclipse strategy:Clean code can be read, and enhanced by a developer other than its original author. It has unit and acceptance tests. It has meaningful names. It provides one way rather than many ways for doing one thing. It has minimal dependencies, which are explicitly defined, and provides a clear and minimal API. Code should be literate since, depending on the language, not all necessary information can be expressed clearly in code alone.        Michael Feathers, author of Working Effectively with Legacy Code:I could list all of the qualities that I notice in clean code, but there is one overarching quality that leads to all of them. Clean code always looks like it was written by someone who cares. There is nothing obvious that you can do to make it better. All of those things were thought about by the code’s author, and if you try to imagine improvements, you are led back to where you are, sitting in appreciation of the code someone left for you—code written by someone who cared deeply about the craft.        Ward Cunningham, inventor of Wiki and Fit, co-inventor of Extreme Programming.You know you are working with clean code when each routine you read turns out to be pretty much what you expected. You can call it beautiful code when the code also makes it look like the language was made for the problem.  Chapter 2: NamingSince naming is something that we as programmers are doing all the time, we better do it right. Here are couple of tips that Uncle Bob has for naming things.  Use Intention revealing names  Avoid Disinformation (Avoid any confusing names)  Make meaningful distinctions (Examples to avoid: a1,a2… or money, moneyAmount)  Use pronouceable names  Use Searchable Names  Avoid Encodings Uncle Bob elaborated on this point mentioning that encoding type or scope information is a bad idea. He mentions multiple notations like - Hungarian Notation, Member prefixes, Interfaces and Implementations.  Avoid Mental Mapping (Avoid using single letter variables or anything that doesn’t represent what it refers to)  Class names shouldn’t be a verb  Try starting method names with verbs  Dont use clever or cute names which can only be understood by some  Pick one word per concept  Pick one concept per word  Use solution domain words (Use words comprehendable for any programmer)  Use problem domain words (Use words specific to the problem to the relevant code)  Add meaningful context  Avoid gratuitous context (Dont add what you dont need to)",
            "content_html": "<h1 id=\"book-summary-series\">Book summary series</h1><h3 id=\"a-handbook-of-agile-software-craftsmanship-by-robert-c-martin\">A Handbook of Agile Software Craftsmanship by Robert C. Martin</h3><p>Clean code is an awesome book written by Uncle Bob and he absolutely nails it when he talks about the basic principles of writing well thought out human readable code. I thought I would make a small collection of takeaways from great books and I decided to start with this classic more like a reference for myself, but would be great to know if it helped someone else on thier journey.</p><h1 id=\"chapter-1-clean-code\">Chapter 1: Clean code</h1><p>The first chapter was mostly a dialogue between the author and the reader. He(the author henceforth) broadly talks about these points.</p><ul>  <li>    <p><strong>There will be code</strong>   He argues that code is always going to exist. No matter whatever fancy future code churning AI comes out, we will always need code as means to fine tune software to the ultimate precision and objectivity to fulfill rules written by humans in our own language.</p>  </li>  <li>    <p><strong>Bad Code</strong>  Here he emphasizes on the LeBlanc’s law: <em>Later equals never</em>. He talks about how we end up writing bad code or code that is difficult to read and comprehend quickly due to various practical constraints of working at a technology company and even cited a <em>killer app</em> in 80s that went down because of their messy code.</p>  </li>  <li>    <p><strong>Total cost of owning a mess</strong>  He talks how code keeps getting tangled with time and addition of new members working with the code and experienced members leaving the organisation. This ultimately leads to the next point.</p>  </li>  <li>    <p><strong>The Grand Redesign in the Sky</strong>  Too many problems, lets start redesigning our systems. However when the redesign happens, it has to keep pace with the existing legacy system. This can take a while to complete and by the time, half of the original people starting the redesign have left the firm.</p>  </li>  <li>    <p><strong>Attitude</strong>  We should own up to the fact that we are the ones who keep writing messy code for whatever reason and that should change.</p>  </li>  <li>    <p><strong>The art of clean code</strong>  Clean code is more like an acquired taste over time of defining what is ‘clean’ and what is not. Everyone might not be easily able to write clean code but should have the eye to spot clean and unclean code.</p>  </li></ul><h3 id=\"what-is-clean-code\">What is Clean code?</h3><p>Clean code has been defined in many ways. There are some mentions of what clean code means to some of the brightest minds of the tech industry.</p><ul>  <li>    <p><strong>Bjarne Stroustrup, inventor of C++:</strong><em>I like my code to be elegant and efficient. The logic should be straightforward and make it hard for bugs to hide, the dependencies minimal to ease maintenance, error handling complete according to an articulated strategy, and performance close to optimal so as not to tempt people to make the code messy with unprincipled optimizations. Clean code does one thing well.</em></p>  </li>  <li>    <p><strong>Grady Booch, author of Object-Oriented Analysis and Design with Applications:</strong><em>Clean code is simple and direct. Clean code reads like well-written prose. Clean code never obscures the designers’ intent but rather is full of crisp abstractions and straightforward lines of control.</em></p>  </li>  <li>    <p><strong>“Big” Dave Thomas, founder of OTI and godfather of the Eclipse strategy:</strong><em>Clean code can be read, and enhanced by a developer other than its original author. It has unit and acceptance tests. It has meaningful names. It provides one way rather than many ways for doing one thing. It has minimal dependencies, which are explicitly defined, and provides a clear and minimal API. Code should be literate since, depending on the language, not all necessary information can be expressed clearly in code alone.</em></p>  </li>  <li>    <p><strong>Michael Feathers, author of Working Effectively with Legacy Code:</strong><em>I could list all of the qualities that I notice in clean code, but there is one overarching quality that leads to all of them. Clean code always looks like it was written by someone who cares. There is nothing obvious that you can do to make it better. All of those things were thought about by the code’s author, and if you try to imagine improvements, you are led back to where you are, sitting in appreciation of the code someone left for you—code written by someone who cared deeply about the craft.</em></p>  </li>  <li>    <p><strong>Ward Cunningham, inventor of Wiki and Fit, co-inventor of Extreme Programming.</strong><em>You know you are working with clean code when each routine you read turns out to be pretty much what you expected. You can call it beautiful code when the code also makes it look like the language was made for the problem.</em></p>  </li></ul><h1 id=\"chapter-2-naming\">Chapter 2: Naming</h1><p>Since naming is something that we as programmers are doing all the time, we better do it right. Here are couple of tips that Uncle Bob has for naming things.</p><ul>  <li><strong>Use Intention revealing names</strong></li>  <li><strong>Avoid Disinformation</strong> (Avoid any confusing names)</li>  <li><strong>Make meaningful distinctions</strong> (<em>Examples to avoid:</em> a1,a2… or money, moneyAmount)</li>  <li><strong>Use pronouceable names</strong></li>  <li><strong>Use Searchable Names</strong></li>  <li><strong>Avoid Encodings</strong> Uncle Bob elaborated on this point mentioning that encoding type or scope information is a bad idea. He mentions multiple notations like - <em>Hungarian Notation, Member prefixes, Interfaces and Implementations.</em></li>  <li><strong>Avoid Mental Mapping</strong> (Avoid using single letter variables or anything that doesn’t represent what it refers to)</li>  <li><strong>Class names shouldn’t be a verb</strong></li>  <li><strong>Try starting method names with verbs</strong></li>  <li><strong>Dont use clever or cute names which can only be understood by some</strong></li>  <li><strong>Pick one word per concept</strong></li>  <li><strong>Pick one concept per word</strong></li>  <li><strong>Use solution domain words</strong> (Use words comprehendable for any programmer)</li>  <li><strong>Use problem domain words</strong> (Use words specific to the problem to the relevant code)</li>  <li><strong>Add meaningful context</strong></li>  <li><strong>Avoid gratuitous context</strong> (Dont add what you dont need to)</li></ul>",
            "url": "thoughtgeek.com/2020/02/20/clean-code",
            
            
            
            "tags": ["Clean-code","codestyling"],
            
            "date_published": "2020-02-20T00:00:00+05:30",
            "date_modified": "2020-02-20T00:00:00+05:30",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>"contact@thoughtgeek.com", "url"=>nil}"
                
            
        },
    
        {
            "id": "thoughtgeek.com/2019/10/03/django-flask",
            "title": "Django vs Flask - Comparison of the python web frameworks",
            "summary": "Comparison of the python web frameworks",
            "content_text": "I would like to congratulate you for deciding to develop web apps using python. Python is currently one of the most popular programming languages around, favored for its clean, readable code, and flexibility. It is also in high demand because of its wide range of web frameworks that can take your project from idea to reality, in the fastest time possible. Let’s first address the most fundamental question.What are web frameworks?A web framework is a code library that makes web development faster and easier by providing common patterns for building reliable, scalable and maintainable web applications. What that means is that a web framework takes away all the boring and repetitive tasks from you and lets you concentrate on building what you want to build. Pretty cool stuff!Frameworks provide functionality in their code or through extensions to perform common operations required to run web applications. These common operations include:  URL routing  Input form handling and validation  HTML, XML, JSON, and other output formats with a templating engine  Database connection configuration and persistent data manipulation through an object-relational mapper (ORM)  Web security against Cross-site request forgery (CSRF), SQL Injection, Cross-site Scripting (XSS) and other common   malicious attacks  Session storage and retrievalNow not all frameworks have all the functionalities listed above. Some frameworks take the “batteries-included” approach where everything possible comes bundled with the framework while others have a minimal core package that can be extended later. Here is where the approach of ‘Flask’ and ‘Django’ differ.What are ‘Flask’ and ‘Django’ exactly?Flask:As they describe themselves (From PyPi) - Flask is a lightweight WSGI web application framework. It is designed to make getting started quick and easy, with the ability to scale up to complex applications. It began as a simple wrapper around Werkzeug and Jinja and has become one of the most popular Python web application frameworks.Now what that basically means is that Flask implements a bare-minimum and leaves the bells and whistles to add-ons or to the developer.Django:For Django, they describe themselves (From PyPi) - Django is a high-level Python Web framework that encourages rapid development and clean, pragmatic design. It is a web application framework with a “batteries-included” philosophy. The principle behind batteries-included is that the common functionality for building web applications should come with the framework instead of as separate libraries. Thus the common functionalities listed above are all available in Django to be quickly implemented.Now you might be thinking why use Flask when Django already provides all the features out of the box. The answer lies in what you are trying to build. Flask provides simplicity, flexibility and fine-grained control. It is unopinionated (it lets you decide how you want to implement things). Thus if you are building a very simple web app or you need to customize all aspects of the app, Flask is a better option. However, the batteries included in Django makes it easier for Django developers to accomplish common web development tasks like user authentication, URL routing and database schema migration. Also, Django accelerates custom web application development by providing built-in template engine, ORM system, and bootstrapping tool. Sounds confusing? Let’s dig into this further and let you make your own choice.How do they match up in terms of performance with each other?Performance Benchmarks:CreditAs we can see from the benchmark, Flask is significantly faster than Django due to the lightweight nature of the framework. However as I mentioned earlier, Django provides a lot of functionalities which are unavailable in Flask for rapid development and prototyping.How popular are both the frameworks?Another key factor for choosing a framework to work with is the way the community embraces it. Let’s look at some popular websites using Flask and Django.Websites using Flask:  Pinterest  Reddit  TwilioWebsites using Django:  Instagram  Disqus  DropboxAlso Django beats Flask in two counts. Django is so popular that it has a large community of django developers who come together once, or maybe twice a year for DjangoCon which is their own conference. Unfortunately Flask doesn’t have any equivalent conference.Also, Flask does not have any corporate sponsors in the same league as the ones with Django like  Microsoft  Eventbrite  Mozilla  Caktus Group  791 TechDjango has been around for longer — it was first released in 2005, while Flask debuted in 2010 — and is more popular — in January 2017, there were 2631 StackOverflow questions about Django and 575 for Flask. Both frameworks are growing steadily in popularity, as can be seen by the number of StackOverflow questions about each in the image below.Thus we can see that overall Django has more community engagement than Flask.Learning curve - Django vs Flask:This is one aspect that Flask beats Django by quite a distance. Flask being a lightweight and barebone framework is easier to grasp than Django. However the learning curve for Django can be rewarding as it makes your job easier later. Let’s try to build a ‘Hello World’ app in both these frameworks and you can be the judge.“Hello Flask”A good practise is to isolate your python environment before installing any packages. This be done using virtual environments. My favourite tool to get this done is ‘virtualenv’. Assuming you are using a debian based distro like Ubuntu, you can do this to install the package -sudo apt-get install virtualenvNow that we have virtualenv installed, let’s create a virtual environment and activate it.virtualenv -p python3 venv/source venv/bin/activate(To deactivate, just type ‘deactivate’)The first thing we need to do in order to use Flask is to install it. This can easily be done by using pip.pip install flaskOnce you’ve done that, create a Python file called flaskhello.py and insert the following code:from flask import Flaskapp = Flask(__name__)@app.route(\"/\")def hello(): return \"Hello, World!\"  if __name__ == \"__main__\": app.run()Let’s understand what this code does:  Line 1 imports Flask  Line 3 initializes an app variable, using the name attribute  Line 5 is where the @app.route python decorator takes the function directly below it and modifies it. We use this to route traffic from a specific URL to the function directly below. Using different @app.route calls, we can ‘trigger’ different parts of the code when the user visits different parts of our application. Here, we only have a single route /, which is the default “root” of our application.  In Line 6 the function is defined. The name ‘hello’ is not important though it’s always a good practice to give your functions a relevant name.  Line 7 returns the string to our user. Usually we would render a template or return HTML here so that users will see a nicely formatted page, but returning a Python string works fine too in our case.  Line 9 is normal Python boilerplate to make sure we don’t run anything automatically if our code is imported by another Python script.  Line 10 calls the run() method of the app we initialized in Line 3. This starts the development server for Flask and allows us to visit our web application from our local machine by visiting localhost. This also takes optional keyword arguments ‘host’ and ‘port’ in case you want to define that.‘Hello Django’Django can also be installed through pip. Run the following command:pip install djangoWhen you installed Django, it also sets up the django-admin command, which we’ll use now. Run the following:django-admin startproject hellodjangoHere we create a Django “project”, and it will create a hellodjango directory. If we look in the hellodjango directory, we’ll see that it created a manage.py file and a subdirectory which is also called hellodjango. Inside the subdirectory there are three Python scripts. We’ll only need to worry about urls.py for our “Hello World” project.The next step is to use Django to create an App, which is an organizational structure below that of a Django Project (one Project can contain many apps). We will use the manage.py file that the previous command created in order to create the application. From the outer hellodjango directory, we run the following command:python manage.py startapp helloworldThis creates the helloworld app and makes it part of our hellodjango project. Now we need to configure the URL routing (like we did with @app.route in Flask). Because Django projects have larger default structure than Flask apps, we’ll have a few extra steps. The previous command created a helloworld directory within the outer hellodjango directory. Open the automatically created helloworld/views.py file and add the following code:from django.http import HttpResponsedef index(request):  return HttpResponse(\"Hello, World!\")  Line 1 imports the HttpResponse function, which we can use to send a string over HTTP to the user of our web app. As with Flask, we wouldn’t usually use this, as we’d want to do more complicated things with rendering HTML templates. However, for our Hello World app this is all we need.  In line 3, we’re defining an index function. Here, unlike with Flask, we don’t use a decorator that says this function should be called when the user visits our application. Instead, we’ll set this up via two urls.py files — one for the project, which was automatically created, and one for the application, which we’ll need to create.  Line 4 returns the “Hello, World!” string wrapped in an HttpResponse so that it can be displayed in our user’s web browser.Now we need to create a urls.py file for our application. Create helloworld/urls.py and add the following code:from django.conf.urls import urlfrom . import viewsurlpatterns = [    url(r'^$', views.index, name='index'),]  Line 1 imports the url function so that we can link specific URLs to functions in our views.py file.  Line 3 imports the views.py file that we added our “Hello, World” index() view to.  Lines 5-7 sets up a list of urlpatterns — this is equivalent to the @app.route decorators that we used in Flask. We match specific URLs using regular expressions, and link these to functions in our views.py script. In this case, we set up a single pattern, which matches an empty URL (like “/” in Flask — in other words, the default page of our application) and links it to the views.index function that we wrote earlier.That’s the URL configuration for our app (helloworld). We also need a URL configuration for our project (hellodjango). Edit the hellodjango/hellodjango/urls.py file, which was automatically created (it might be a bit confusing that there are two urls.py files, but it should make sense if you think of one belonging to the entire project, routing URLs to different apps, and the other belonging to the helloworld app alone). Add the following code:from django.conf.urls import include, url  urlpatterns = [     url(r'^hello/', include('helloworld.urls')), ]This is similar to the previous file. However, instead of routing URLs of a specific pattern to a specific view, we are routing them to a specific application. In this case, any URL that has /hello after it will be sent along to our helloworld application and will look in helloworld.urls to work out which view to call.Now go back to the outer /hellodjango directory (the one which contains the manage.py file) and run the following command:python manage.py runserverThis runs the Django development server, which lets us visit our application on localhost, as we did with Flask. You should see output that is similar to the following:Performing system checks…System check identified no issues (0 silenced).You have 13 unapplied migration(s). Your project may not work properly until you apply the migrations for app(s): admin, auth, contenttypes, sessions.Run 'python manage.py migrate' to apply them.February 03, 2017 - 16:14:20Django version 1.10.5, using settings 'hellodjango.settings'Starting development server at http://127.0.0.1:8000/Quit the server with CONTROL-C.You can ignore the warning about the migrations — this is related to the database for the web application, which we are not using. We can visit http://127.0.0.1:8000/hello to view our “Hello, World!” greeting (don’t forget the /hello at the end, which tells Django which app to visit).So finally you now know enough to make your choiceSo we have gone through a comparative analysis of the python web frameworks - Flask and Django. Now I think you are armed with enough knowledge to make an informed decision for yourself and your project. So go on, try it yourself!",
            "content_html": "<p>I would like to congratulate you for deciding to develop web apps using python. Python is currently one of the most popular programming languages around, favored for its clean, readable code, and flexibility. It is also in high demand because of its wide range of web frameworks that can take your project from idea to reality, in the fastest time possible. Let’s first address the most fundamental question.</p><h1 id=\"what-are-web-frameworks\">What are web frameworks?</h1><p>A web framework is a code library that makes web development faster and easier by providing common patterns for building reliable, scalable and maintainable web applications. What that means is that a web framework takes away all the boring and repetitive tasks from you and lets you concentrate on building what you want to build. Pretty cool stuff!<br />Frameworks provide functionality in their code or through extensions to perform common operations required to run web applications. These common operations include:</p><ul>  <li>URL routing</li>  <li>Input form handling and validation</li>  <li>HTML, XML, JSON, and other output formats with a templating engine</li>  <li>Database connection configuration and persistent data manipulation through an object-relational mapper (ORM)</li>  <li>Web security against Cross-site request forgery (CSRF), SQL Injection, Cross-site Scripting (XSS) and other common   malicious attacks</li>  <li>Session storage and retrieval</li></ul><p>Now not all frameworks have all the functionalities listed above. Some frameworks take the “batteries-included” approach where everything possible comes bundled with the framework while others have a minimal core package that can be extended later. Here is where the approach of ‘Flask’ and ‘Django’ differ.</p><h1 id=\"what-are-flask-and-django-exactly\">What are ‘Flask’ and ‘Django’ exactly?</h1><h5 id=\"flask\">Flask:</h5><p>As they describe themselves (From PyPi) - Flask is a lightweight WSGI web application framework. It is designed to make getting started quick and easy, with the ability to scale up to complex applications. It began as a simple wrapper around Werkzeug and Jinja and has become one of the most popular Python web application frameworks.Now what that basically means is that Flask implements a bare-minimum and leaves the bells and whistles to add-ons or to the developer.</p><h5 id=\"django\">Django:</h5><p>For Django, they describe themselves (From PyPi) - Django is a high-level Python Web framework that encourages rapid development and clean, pragmatic design. It is a web application framework with a “batteries-included” philosophy. The principle behind batteries-included is that the common functionality for building web applications should come with the framework instead of as separate libraries. Thus the common functionalities listed above are all available in Django to be quickly implemented.</p><p>Now you might be thinking why use Flask when Django already provides all the features out of the box. The answer lies in what you are trying to build. Flask provides simplicity, flexibility and fine-grained control. It is unopinionated (it lets you decide how you want to implement things). Thus if you are building a very simple web app or you need to customize all aspects of the app, Flask is a better option. However, the batteries included in Django makes it easier for Django developers to accomplish common web development tasks like user authentication, URL routing and database schema migration. Also, Django accelerates custom web application development by providing built-in template engine, ORM system, and bootstrapping tool. Sounds confusing? Let’s dig into this further and let you make your own choice.</p><h1 id=\"how-do-they-match-up-in-terms-of-performance-with-each-other\">How do they match up in terms of performance with each other?</h1><h5 id=\"performance-benchmarks\">Performance Benchmarks:</h5><p><img src=\"/images/benchmarks.png\" alt=\"benchmarks\" /><a class=\"caption\" href=\"http://klen.github.io/py-frameworks-bench/\">Credit</a></p><p>As we can see from the benchmark, Flask is significantly faster than Django due to the lightweight nature of the framework. However as I mentioned earlier, Django provides a lot of functionalities which are unavailable in Flask for rapid development and prototyping.</p><h1 id=\"how-popular-are-both-the-frameworks\">How popular are both the frameworks?</h1><p>Another key factor for choosing a framework to work with is the way the community embraces it. Let’s look at some popular websites using Flask and Django.</p><h5 id=\"websites-using-flask\">Websites using Flask:</h5><ul>  <li>Pinterest</li>  <li>Reddit</li>  <li>Twilio</li></ul><h5 id=\"websites-using-django\">Websites using Django:</h5><ul>  <li>Instagram</li>  <li>Disqus</li>  <li>Dropbox</li></ul><p>Also Django beats Flask in two counts. Django is so popular that it has a large community of django developers who come together once, or maybe twice a year for <strong>DjangoCon</strong> which is their own conference. Unfortunately Flask doesn’t have any equivalent conference.Also, Flask does not have any corporate sponsors in the same league as the ones with Django like</p><ul>  <li>Microsoft</li>  <li>Eventbrite</li>  <li>Mozilla</li>  <li>Caktus Group</li>  <li>791 Tech</li></ul><p>Django has been around for longer — it was first released in 2005, while Flask debuted in 2010 — and is more popular — in January 2017, there were 2631 StackOverflow questions about Django and 575 for Flask. Both frameworks are growing steadily in popularity, as can be seen by the number of StackOverflow questions about each in the image below.<img src=\"/images/so_questions.png\" alt=\"so_questions\" />Thus we can see that overall Django has more community engagement than Flask.</p><h1 id=\"learning-curve---django-vs-flask\">Learning curve - Django vs Flask:</h1><p>This is one aspect that Flask beats Django by quite a distance. Flask being a lightweight and barebone framework is easier to grasp than Django. However the learning curve for Django can be rewarding as it makes your job easier later. Let’s try to build a ‘Hello World’ app in both these frameworks and you can be the judge.</p><h2 id=\"hello-flask\">“Hello Flask”</h2><p>A good practise is to isolate your python environment before installing any packages. This be done using virtual environments. My favourite tool to get this done is ‘virtualenv’. Assuming you are using a debian based distro like Ubuntu, you can do this to install the package -</p><pre><code>sudo apt-get install virtualenv</code></pre><p>Now that we have virtualenv installed, let’s create a virtual environment and activate it.</p><pre><code>virtualenv -p python3 venv/source venv/bin/activate</code></pre><p>(To deactivate, just type ‘deactivate’)</p><p>The first thing we need to do in order to use Flask is to install it. This can easily be done by using pip.</p><pre><code>pip install flask</code></pre><p>Once you’ve done that, create a Python file called flaskhello.py and insert the following code:</p><pre><code>from flask import Flaskapp = Flask(__name__)@app.route(\"/\")def hello(): return \"Hello, World!\"  if __name__ == \"__main__\": app.run()</code></pre><h5 id=\"lets-understand-what-this-code-does\">Let’s understand what this code does:</h5><ul>  <li>Line 1 imports Flask</li>  <li>Line 3 initializes an app variable, using the <strong>name</strong> attribute</li>  <li>Line 5 is where the @app.route python decorator takes the function directly below it and modifies it. We use this to route traffic from a specific URL to the function directly below. Using different @app.route calls, we can ‘trigger’ different parts of the code when the user visits different parts of our application. Here, we only have a single route /, which is the default “root” of our application.</li>  <li>In Line 6 the function is defined. The name ‘hello’ is not important though it’s always a good practice to give your functions a relevant name.</li>  <li>Line 7 returns the string to our user. Usually we would render a template or return HTML here so that users will see a nicely formatted page, but returning a Python string works fine too in our case.</li>  <li>Line 9 is normal Python boilerplate to make sure we don’t run anything automatically if our code is imported by another Python script.</li>  <li>Line 10 calls the run() method of the app we initialized in Line 3. This starts the development server for Flask and allows us to visit our web application from our local machine by visiting localhost. This also takes optional keyword arguments ‘host’ and ‘port’ in case you want to define that.</li></ul><h2 id=\"hello-django\">‘Hello Django’</h2><p>Django can also be installed through pip. Run the following command:</p><pre><code>pip install django</code></pre><p>When you installed Django, it also sets up the django-admin command, which we’ll use now. Run the following:</p><pre><code>django-admin startproject hellodjango</code></pre><p>Here we create a Django “project”, and it will create a hellodjango directory. If we look in the hellodjango directory, we’ll see that it created a manage.py file and a subdirectory which is also called hellodjango. Inside the subdirectory there are three Python scripts. We’ll only need to worry about urls.py for our “Hello World” project.</p><p>The next step is to use Django to create an App, which is an organizational structure below that of a Django Project (one Project can contain many apps). We will use the manage.py file that the previous command created in order to create the application. From the outer hellodjango directory, we run the following command:</p><pre><code>python manage.py startapp helloworld</code></pre><p>This creates the helloworld app and makes it part of our hellodjango project. Now we need to configure the URL routing (like we did with @app.route in Flask). Because Django projects have larger default structure than Flask apps, we’ll have a few extra steps. The previous command created a helloworld directory within the outer hellodjango directory. Open the automatically created helloworld/views.py file and add the following code:</p><pre><code>from django.http import HttpResponsedef index(request):  return HttpResponse(\"Hello, World!\")</code></pre><ul>  <li>Line 1 imports the HttpResponse function, which we can use to send a string over HTTP to the user of our web app. As with Flask, we wouldn’t usually use this, as we’d want to do more complicated things with rendering HTML templates. However, for our Hello World app this is all we need.</li>  <li>In line 3, we’re defining an index function. Here, unlike with Flask, we don’t use a decorator that says this function should be called when the user visits our application. Instead, we’ll set this up via two urls.py files — one for the project, which was automatically created, and one for the application, which we’ll need to create.</li>  <li>Line 4 returns the “Hello, World!” string wrapped in an HttpResponse so that it can be displayed in our user’s web browser.</li></ul><p>Now we need to create a urls.py file for our application. Create helloworld/urls.py and add the following code:</p><pre><code>from django.conf.urls import urlfrom . import viewsurlpatterns = [    url(r'^$', views.index, name='index'),]</code></pre><ul>  <li>Line 1 imports the url function so that we can link specific URLs to functions in our views.py file.</li>  <li>Line 3 imports the views.py file that we added our “Hello, World” index() view to.</li>  <li>Lines 5-7 sets up a list of urlpatterns — this is equivalent to the @app.route decorators that we used in Flask. We match specific URLs using regular expressions, and link these to functions in our views.py script. In this case, we set up a single pattern, which matches an empty URL (like “/” in Flask — in other words, the default page of our application) and links it to the views.index function that we wrote earlier.</li></ul><p>That’s the URL configuration for our app (helloworld). We also need a URL configuration for our project (hellodjango). Edit the hellodjango/hellodjango/urls.py file, which was automatically created (it might be a bit confusing that there are two urls.py files, but it should make sense if you think of one belonging to the entire project, routing URLs to different apps, and the other belonging to the helloworld app alone). Add the following code:</p><pre><code>from django.conf.urls import include, url  urlpatterns = [     url(r'^hello/', include('helloworld.urls')), ]</code></pre><p>This is similar to the previous file. However, instead of routing URLs of a specific pattern to a specific view, we are routing them to a specific application. In this case, any URL that has /hello after it will be sent along to our helloworld application and will look in helloworld.urls to work out which view to call.Now go back to the outer /hellodjango directory (the one which contains the manage.py file) and run the following command:</p><pre><code>python manage.py runserver</code></pre><p>This runs the Django development server, which lets us visit our application on localhost, as we did with Flask. You should see output that is similar to the following:</p><pre><code>Performing system checks…System check identified no issues (0 silenced).You have 13 unapplied migration(s). Your project may not work properly until you apply the migrations for app(s): admin, auth, contenttypes, sessions.Run 'python manage.py migrate' to apply them.February 03, 2017 - 16:14:20Django version 1.10.5, using settings 'hellodjango.settings'Starting development server at http://127.0.0.1:8000/Quit the server with CONTROL-C.</code></pre><p>You can ignore the warning about the migrations — this is related to the database for the web application, which we are not using. We can visit http://127.0.0.1:8000/hello to view our “Hello, World!” greeting (don’t forget the /hello at the end, which tells Django which app to visit).</p><h1 id=\"so-finally-you-now-know-enough-to-make-your-choice\">So finally you now know enough to make your choice</h1><p>So we have gone through a comparative analysis of the python web frameworks - Flask and Django. Now I think you are armed with enough knowledge to make an informed decision for yourself and your project. So go on, try it yourself!</p>",
            "url": "thoughtgeek.com/2019/10/03/django-flask",
            
            
            
            "tags": ["django","flask","python","web"],
            
            "date_published": "2019-10-03T00:00:00+05:30",
            "date_modified": "2019-10-03T00:00:00+05:30",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>"contact@thoughtgeek.com", "url"=>nil}"
                
            
        },
    
        {
            "id": "thoughtgeek.com/2019/03/29/meet-your-team",
            "title": "What to expect when you meet your remote team first time",
            "summary": "A memoir on first team camp",
            "content_text": "“Coming together is a beginning. Keeping together is progress. Working together is success.” - Henry FordI would share an outsider’s view on working remotely with a multicultural, multinational team where you have colleagues who come from completely different places and backgrounds. You might be sceptical about fitting in a team which has such diversity. The reality was much different than I expected. The team had already been working together for quite a number of years and I was surprised by the warmth with which I was embraced in the envelope despite being a new hire. Here are couple of things I think you should expect when meeting your remote team for the first time in person.Be ready for a new experienceIf your team camp is somewhere away from home, maybe even a different province if not country, be ready to be surprised by the new culture. Probably it is home or near the home of any of your team member and you would be getting a glimpse of what their daily life might look like. For our case, Johor Bahru is home to our CTO Kamal and exploring the city and nearabouts you get a nice insight into what it might be like for him around the city, the food that he might like, the places he might be around when he is not busy staring at the screen of his laptop.Cendol stallForm a bond on a personal levelWhen you stay together with your team you create a special level of bonding with them. Extending my earlier point, you get to understand their habits, likes and dislikes. When working in a remote team, often you forget that you are actually working with a team that has all the human intricacies which are generally associated with working with a onsite/local team. I learnt why I should not ever teach Zaki a game. He beated me straight two times while I was explaining him the rules of the game!Playing poolStumble upon a challenge when starting offThis might be more relevant for myself than others, but if you are meeting your team for the first time you might share this opinion too. This was my first meet with the team after being inducted and I found my first assignment to be a bit challenging probably because I was taking the leap from being an intern to a full time member. I was assigned a task to use django-q for asynchronous task processing, which was a new thing for me. It took a while to understand how things worked and the whole process amounted to great learning. I realized that such challenges are just a underwriting of the job role, and that’s exactly what had I signed up for. However, having your team right there to help you during those initial phases can be tremendous boon and make sure you make the most of it.At workBe ready to eat a lot if you are in a team of foodies like XoxzoThis maybe a bit exclusive to us at Xoxzo, but who knows it might even stand true for a lot of teams. As our CEO, Iqbal mentioned about always ending up eating a lot when having a team camp in Malaysia, I assume it is a tradition that didn’t have much of an exception at our team camp at Johor Bahru aswell. With Kamal getting local delicacies and finger food everyday while coming to our apartment to grabbing meals with the team accommodating Josef’s obsession over Nasi Goreng, it was food that made us bond together.Malaysian FoodLearn a lot of things outside work￼‘We’ at Xoxzo comprise of individuals coming from distant cultures. That makes any team camp a melting pot of cultures and we get to learn so much about about each other’s cultures and share about our own while staying and working together. This was a great feeling understanding that though we come from such diverse backgrounds, there are so many things that we have in common. I feel this personally made me a better human and I think it will be a great experience for anyone who embraces diversity with an open mind and arms.Unity in diversityPrepare to have a lot of funMeeting your team will always be fun. This is more of a vacation with a purpose. There will be some great moments you will have with your team. From Kamal’s favourite cendol vendor, to the driving almost to Singapore without a passport, we had a lot of fun moments I will cherish forever about my first meet with the team. Prepare to create yours!JB in nightUnderstand and absorb the culture of the teamEvery team has a underlying DNA which defines what they stand for. This DNA or the culture of the team is ever changing, just like team itself. Some of it comes from the founders, but mostly it’s a mindset which is shared by the majority of the team. Our team at Xoxzo is a tight group of individuals, highly passionate about technology and innovation. Our engineering team comprises of  Josef, a keen Raspberry Pi tinkerer, and Zaki, is a information security geek while Geraldo, our marketing guru is the former founder of a novel packaged cocktail company in Brazil. Certainly that reflects a lot about the team!The team(partial)",
            "content_html": "<p><em>“Coming together is a beginning. Keeping together is progress. Working together is success.”</em> - <strong>Henry Ford</strong></p><p>I would share an outsider’s view on working remotely with a multicultural, multinational team where you have colleagues who come from completely different places and backgrounds. You might be sceptical about fitting in a team which has such diversity. The reality was much different than I expected. The team had already been working together for quite a number of years and I was surprised by the warmth with which I was embraced in the envelope despite being a new hire. Here are couple of things I think you should expect when meeting your remote team for the first time in person.</p><h3 id=\"be-ready-for-a-new-experience\">Be ready for a new experience</h3><p>If your team camp is somewhere away from home, maybe even a different province if not country, be ready to be surprised by the new culture. Probably it is home or near the home of any of your team member and you would be getting a glimpse of what their daily life might look like. For our case, Johor Bahru is home to our CTO Kamal and exploring the city and nearabouts you get a nice insight into what it might be like for him around the city, the food that he might like, the places he might be around when he is not busy staring at the screen of his laptop.</p><p><img src=\"/images/cendol.jpg\" alt=\"cendol\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">Cendol stall</center></p><h3 id=\"form-a-bond-on-a-personal-level\">Form a bond on a personal level</h3><p>When you stay together with your team you create a special level of bonding with them. Extending my earlier point, you get to understand their habits, likes and dislikes. When working in a remote team, often you forget that you are actually working with a team that has all the human intricacies which are generally associated with working with a onsite/local team. I learnt why I should not ever teach Zaki a game. He beated me straight two times while I was explaining him the rules of the game!</p><p><img src=\"/images/pool.jpg\" alt=\"pool\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">Playing pool</center></p><h3 id=\"stumble-upon-a-challenge-when-starting-off\">Stumble upon a challenge when starting off</h3><p>This might be more relevant for myself than others, but if you are meeting your team for the first time you might share this opinion too. This was my first meet with the team after being inducted and I found my first assignment to be a bit challenging probably because I was taking the leap from being an intern to a full time member. I was assigned a task to use django-q for asynchronous task processing, which was a new thing for me. It took a while to understand how things worked and the whole process amounted to great learning. I realized that such challenges are just a underwriting of the job role, and that’s exactly what had I signed up for. However, having your team right there to help you during those initial phases can be tremendous boon and make sure you make the most of it.</p><p><img src=\"/images/hustle.jpg\" alt=\"hustle\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">At work</center></p><h3 id=\"be-ready-to-eat-a-lot-if-you-are-in-a-team-of-foodies-like-xoxzo\">Be ready to eat a lot if you are in a team of foodies like Xoxzo</h3><p>This maybe a bit exclusive to us at <a href=\"https://www.xoxzo.com/en/\">Xoxzo</a>, but who knows it might even stand true for a lot of teams. As our CEO, Iqbal mentioned about always ending up eating a lot when having a team camp in Malaysia, I assume it is a tradition that didn’t have much of an exception at our team camp at Johor Bahru aswell. With Kamal getting local delicacies and finger food everyday while coming to our apartment to grabbing meals with the team accommodating Josef’s obsession over Nasi Goreng, it was food that made us bond together.</p><p><img src=\"/images/food.jpg\" alt=\"food\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">Malaysian Food</center></p><h3 id=\"learn-a-lot-of-things-outside-work\">Learn a lot of things outside work￼</h3><p>‘We’ at <a href=\"https://www.xoxzo.com/en/\">Xoxzo</a> comprise of individuals coming from distant cultures. That makes any team camp a melting pot of cultures and we get to learn so much about about each other’s cultures and share about our own while staying and working together. This was a great feeling understanding that though we come from such diverse backgrounds, there are so many things that we have in common. I feel this personally made me a better human and I think it will be a great experience for anyone who embraces diversity with an open mind and arms.</p><p><img src=\"/images/diversity.jpg\" alt=\"diversity\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">Unity in diversity</center></p><h3 id=\"prepare-to-have-a-lot-of-fun\">Prepare to have a lot of fun</h3><p>Meeting your team will always be fun. This is more of a vacation with a purpose. There will be some great moments you will have with your team. From Kamal’s favourite cendol vendor, to the driving almost to Singapore without a passport, we had a lot of fun moments I will cherish forever about my first meet with the team. Prepare to create yours!</p><p><img src=\"/images/jb_night.jpg\" alt=\"jb_night\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">JB in night</center></p><h3 id=\"understand-and-absorb-the-culture-of-the-team\">Understand and absorb the culture of the team</h3><p>Every team has a underlying DNA which defines what they stand for. This DNA or the culture of the team is ever changing, just like team itself. Some of it comes from the founders, but mostly it’s a mindset which is shared by the majority of the team. Our team at <a href=\"https://www.xoxzo.com/en/\">Xoxzo</a> is a tight group of individuals, highly passionate about technology and innovation. Our engineering team comprises of  Josef, a keen Raspberry Pi tinkerer, and Zaki, is a information security geek while Geraldo, our marketing guru is the former founder of a novel packaged cocktail company in Brazil. Certainly that reflects a lot about the team!</p><p><img src=\"/images/team.jpeg\" alt=\"team\" /><center style=\"margin-top: -28px; font-size: .85rem; color: #888;\">The team(partial)</center></p><team pic=\"\"></team>",
            "url": "thoughtgeek.com/2019/03/29/meet-your-team",
            
            
            
            
            
            "date_published": "2019-03-29T00:00:00+05:30",
            "date_modified": "2019-03-29T00:00:00+05:30",
            
                "author": 
                "{"twitter"=>nil, "name"=>nil, "avatar"=>nil, "email"=>"contact@thoughtgeek.com", "url"=>nil}"
                
            
        }
    
    ]
}